Revit 2024 API
AnnotationSymbol.duplicate Method
Duplicate this annotation symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public AnnotationSymbol duplicate()
Visual Basic
Public Function duplicate As AnnotationSymbol
Visual C++
public:
AnnotationSymbol^ duplicate()
Return Value
Pointer to the new annotation symbol.
See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace